io_port.html
<!DOCTYPE html>
<html lang="cn">
<head>
<!-- 2020-11-06 Fri 23:24 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>关于驱动的一些内核接口介绍</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Cauchy                                                             #+OPTIONS: ^:nil Cauchy">
<link rel="stylesheet" href="./org-manual.css" type="text/css">
<link rel="stylesheet" href="./org-manual.css" type="text/css">
</head>
<body>
<div id="content">
<h1 class="title">关于驱动的一些内核接口介绍</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgae86892">1. 函数介绍</a></li>
</ul>
</div>
</div>
<p>
本文介绍一些关于内核在使用IO硬件资源时会使用到的一些内核内部接口，在介绍完了这些接口后会给
出一个完整的小例子。
</p>

<p>
驱动和硬件进行沟通，采用IO端口的方式。内核提供了许多这样的函数来产生这样的端口。
</p>

<p>
TODO：<a href="https://www.quora.com/Linux-Kernel-What-is-the-difference-between-request_mem_region-and-request_region">https://www.quora.com/Linux-Kernel-What-is-the-difference-between-request_mem_region-and-request_region</a>
</p>

<div id="outline-container-orgae86892" class="outline-2">
<h2 id="orgae86892"><span class="section-number-2">1</span> 函数介绍</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>request\<sub>region</sub>：由内核提供，允许驱动去声明它需要的端口。从first开始的n个端口，name参数
是设备的名字。
<ul class="org-ul">
<li>头文件: #include &lt;linux/ioport.h&gt;</li>
<li><p>
原型:
</p>
<div class="org-src-container">
<pre class="src src-C"><span style="color: #F0DFAF; font-weight: bold;">struct</span> <span style="color: #7CB8BB;">resource</span> *<span style="color: #93E0E3;">request_region</span>(<span style="color: #7CB8BB;">unsigned</span> <span style="color: #7CB8BB;">long</span> <span style="color: #DFAF8F;">first</span>, <span style="color: #7CB8BB;">unsigned</span> <span style="color: #7CB8BB;">long</span> <span style="color: #DFAF8F;">n</span>, <span style="color: #F0DFAF; font-weight: bold;">const</span> <span style="color: #7CB8BB;">char</span> *<span style="color: #DFAF8F;">name</span>);
</pre>
</div></li>
<li>返回值：成功非NULL，如果期待的端口不可提供，则返回NULL。</li>
</ul></li>
</ul>
<p>
所有已经分配的端口可以在/proc/ioports里查看。
</p>


<p>
本文介绍一些关于内核在使用IO硬件资源时会使用到的一些内核内部接口，在介绍完了这些接口后会给
出一个完整的小例子。
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Cauchy                                                             #+OPTIONS: ^:nil Cauchy</p>
<p class="date">Created: 2020-11-06 Fri 23:24</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
